<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b479fa458fe58536af954063dda87d82d3dc1f4d38a3f3c7df32cc59ca798927","plan_job_ref":"Job Terraform checks on pull request #31 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/12142081592","plan_out_hash":"fb371905df736cb506d436eff82685a84df7ebdf5505a428887459fae5794f3d","plan_hash":"5f94c41c92def3b33423205f1851b1217f294b501818183a3f61e90099f1db0d","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 0 to add, 19 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.terraform.module.aws.api_gateway"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.api_gateway"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.api_gateway"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.api_gateway"
        name                        = "sudoblark.terraform.module.aws.api_gateway"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.api_gateway"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.api_gateway/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.elastic_container_registry"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.elastic_container_registry"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.elastic_container_registry"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.elastic_container_registry"
        name                        = "sudoblark.terraform.module.aws.elastic_container_registry"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.elastic_container_registry"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.elastic_container_registry/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.event_bridge_rule"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.event_bridge_rule"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.event_bridge_rule"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.event_bridge_rule"
        name                        = "sudoblark.terraform.module.aws.event_bridge_rule"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.event_bridge_rule"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.event_bridge_rule/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.iam_role"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.iam_role"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.iam_role"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.iam_role"
        name                        = "sudoblark.terraform.module.aws.iam_role"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.iam_role"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.iam_role/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.lambda"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.lambda"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.lambda"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.lambda"
        name                        = "sudoblark.terraform.module.aws.lambda"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.lambda"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.lambda/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.s3_bucket"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.s3_bucket"
        name                        = "sudoblark.terraform.module.aws.s3_bucket"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.s3_bucket/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket_notifications"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.s3_bucket_notifications"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket_notifications"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.s3_bucket_notifications"
        name                        = "sudoblark.terraform.module.aws.s3_bucket_notifications"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket_notifications"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.s3_bucket_notifications/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.security_group"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.security_group"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.security_group"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.security_group"
        name                        = "sudoblark.terraform.module.aws.security_group"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.security_group"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.security_group/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.sns"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.sns/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.state_machine"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.state_machine"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.state_machine"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.state_machine"
        name                        = "sudoblark.terraform.module.aws.state_machine"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.state_machine"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.state_machine/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

Plan: 0 to add, 19 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #31](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/12142081592)